Let's start with a DataFrame that includes several types of common data issues:

In [1]:
import pandas as pd
import numpy as np

# Define a DataFrame
data = {
    'Name': ['John Doe', 'Jane Smith', np.nan, 'Mike Brown', '', 'Amy '],
    'Age': ['30', 'Twenty five', '55', 'Invalid', 23, ' '],
    'Salary': [3000, 2000, '', 4000, np.nan, 5000],
    'Start date': ['01-01-2010', '20110607', '6/15/2009', '2014/05/04', '', '02-30-2010'],
    'Department': ['Sales', 'Marketing', 'Marketing', 'HR', 'HR', ''],
    'Gender': ['M', 'F', 'F', '', 'M', 'F'],
}

df = pd.DataFrame(data)

This DataFrame contains missing values (np.nan and empty strings), inconsistent representations (of dates, for instance), and erroneous values ('Invalid' in the 'Age' column).

# Missing Data Handling

In [2]:
# Replace empty strings with np.nan
df.replace('', np.nan, inplace=True)

In [3]:
# Fill missing Names with 'Unknown'
df['Name'].fillna('Unknown', inplace=True)

In [4]:
# Fill missing Ages with the mean age
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [5]:
# Drop the rows where at least one element is missing in the columns 'Start date', 'Department' and 'Gender'
df.dropna(subset=['Start date', 'Department', 'Gender'], inplace=True)

# Data Cleaning

In [6]:
# Strip leading and trailing spaces from names
df['Name'] = df['Name'].str.strip()

In [7]:
# Standardize gender to lowercase
df['Gender'] = df['Gender'].str.lower()

In [8]:
# Replace 'm' with 'Male' and 'f' with 'Female' in 'Gender'
df['Gender'].replace({'m': 'Male', 'f': 'Female'}, inplace=True)

In [ ]:
df

# Date Formatting

In [10]:
# Convert 'Start date' to datetime format
df['Start date'] = pd.to_datetime(df['Start date'], errors='coerce')

# One Hot Encoding (Dummy Variables)

In [11]:
# Get one-hot encoding of 'Department'
one_hot = pd.get_dummies(df['Department'])

In [12]:

# Drop 'Department' column as it is now encoded
df = df.drop('Department', axis=1)

In [13]:

# Join the encoded df
df = df.join(one_hot)

In [ ]:
df

         Name   Age  Salary Start date  Gender  Marketing  Sales
0    John Doe  30.0  3000.0 2010-01-01    Male          0      1
1  Jane Smith  36.0  2000.0 2011-06-07  Female          1      0
2     Unknown  55.0     NaN 2009-06-15  Female          1      0

# Data Transformation

In [ ]:
# Create a new column 'Seniority' based on 'Start date'
df['Seniority'] = pd.datetime.now().year - df['Start date'].dt.year

C:\Users\3181\AppData\Local\Temp\ipykernel_16104\1161486638.py:2: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  df['Seniority'] = pd.datetime.now().year - df['Start date'].dt.year

In [ ]:
df

# Normalization

In [ ]:
# Normalize 'Salary' column (min-max normalization)
df['Salary'] = (df['Salary'] - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())

In [ ]:
df

# Date Transformations

**Extracting Parts of a Date:** You might want to extract the year, month, day, day of the week, etc., from a date column.

In [ ]:
# Extract the year from 'Start date'
df['Start Year'] = df['Start date'].dt.year

# Extract the month from 'Start date'
df['Start Month'] = df['Start date'].dt.month

# Extract the day of the week from 'Start date' (0 is Monday and 6 is Sunday)
df['Start Day of Week'] = df['Start date'].dt.dayofweek

In [ ]:
df

,Name,Age,Salary,Start date,Gender,Marketing,Sales,Seniority,Start Year,Start Month,Start Day of Week
0,John Doe,30.0,1.0,2010-01-01,Male,0,1,13,2010,1,4
1,Jane Smith,36.0,0.0,2011-06-07,Female,1,0,12,2011,6,1
2,Unknown,55.0,NaN,2009-06-15,Female,1,0,14,2009,6,0

**Creating Boolean Flags:** You might want to create flags indicating whether a certain condition is met. For example, you could create a flag for whether the start date is on a weekend.

In [ ]:
# Create a boolean flag for whether the start date is on a weekend
df['Starts on Weekend'] = df['Start Day of Week'].isin([5, 6])

**Converting Timezones:** If your dates are in a specific timezone, you might need to convert them to another timezone.

In [ ]:
# Assume 'Start date' is in UTC and convert to US Eastern Time
# Localize the 'Start date' column to UTC
df['Start date'] = df['Start date'].dt.tz_localize('UTC')

df['Start date'] = df['Start date'].dt.tz_convert('US/Eastern')

In [ ]:
df

**Calculating Time Since:** You might want to calculate the number of days, months, or years since a certain date.

In [ ]:
# Calculate the number of days since 'Start date'
df['Days Since Start'] = (pd.to_datetime('today').tz_localize('US/Eastern') - df['Start date']).dt.days

In [ ]:
df

**Date Binning:** You can group dates into bins such as quarters of a year or parts of a day.

In [ ]:
# Bin 'Start date' into quarters
df['Start Quarter'] = df['Start date'].dt.to_period('Q')

C:\Users\3181\Anaconda3\lib\site-packages\pandas\core\arrays\datetimes.py:1162: UserWarning: Converting to PeriodArray/Index representation will drop timezone information.
  warnings.warn(

In [ ]:
df